# ListAllFailureDefinitions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureDefinitionRegistry..::..ListAllFailureDefinitions Method
FailureDefinitionRegistry Class See Also
---
Retrieves all the registered FailureDefinitions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public IList<FailureDefinitionAccessor> ListAllFailureDefinitions()
```

Visual Basic
---
```text
Public Function ListAllFailureDefinitions As IList(Of FailureDefinitionAccessor)
```

Visual C++
---
```text
public:
IList<FailureDefinitionAccessor^>^ ListAllFailureDefinitions()
```

# ### Return Value
All the registered FailureDefinitions.
# See Also
FailureDefinitionRegistry Class
Autodesk.Revit.DB Namespace